README.md
```mermaid
erDiagram
    orders ||--o{ cards : contains
    cards ||--o{ card_status_history : tracks
    cards ||--o{ laser_data : has
    cards ||--o{ magnet_data : has
    cards ||--o{ mifare_data : has
    orders {
      TEXT uuid PK
      TEXT order_name UK
      TEXT status
      INTEGER order_date
      INTEGER created_at
      INTEGER updated_at
    }
    cards {
      TEXT uuid PK
      TEXT uuid_order FK
      BOOLEAN has_laser
      BOOLEAN has_magnet
      BOOLEAN has_mifare_uid
      BOOLEAN is_done
    }
    card_status_history {
      TEXT uuid PK
      TEXT uuid_card FK
      TEXT status
      INTEGER created_at
    }
    laser_data {
      TEXT uuid PK
      TEXT uuid_card FK
      TEXT side
      INTEGER row_no
      TEXT content_type
      BLOB content
    }
    magnet_data {
      TEXT uuid PK
      TEXT uuid_card FK
      INTEGER track_no
      BLOB content
    }
    mifare_data {
      TEXT uuid PK
      TEXT uuid_card FK
      INTEGER block_no
      BLOB key_a
      BLOB key_b
      BLOB content
    }
```
